Revit 2024 API
BuiltInFailures.SketchFailures.RailingDoublyConnectedError Property
 Railings hosted on Stairs must form a single, open, connected line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RailingDoublyConnectedError { get; }
Visual Basic
Public Shared ReadOnly Property RailingDoublyConnectedError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RailingDoublyConnectedError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace